In [1]:
pip install pyspark

Collecting pyspark
  Downloading pyspark-3.5.2.tar.gz (317.3 MB)
     |████████████████████████████████| 317.3 MB 570 bytes/s  0:00:011
Collecting py4j==0.10.9.7
  Downloading py4j-0.10.9.7-py2.py3-none-any.whl (200 kB)
     |████████████████████████████████| 200 kB 122.0 MB/s eta 0:00:01
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.5.2-py2.py3-none-any.whl size=317812389 sha256=3eab92bbadcdd91b7b31f2cbaa695f345056cbfd313bec44282ade3af427f9f8
  Stored in directory: /Users/tushtivinodverma/Library/Caches/pip/wheels/11/67/ea/33c283e520b775aa7a7a0d404447e287be841a711d074d4d91
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.7 pyspark-3.5.2
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pyspark

In [4]:
from pyspark.sql import SparkSession

## Starting a Spark Session

In [6]:
spark = SparkSession.builder.appName('Practice').getOrCreate()

24/08/13 14:12:29 WARN Utils: Your hostname, Tushtis-MacBook-Air.local resolves to a loopback address: 127.0.0.1; using 192.168.4.37 instead (on interface en0)
24/08/13 14:12:29 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
24/08/13 14:12:29 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [7]:
spark

## Read the data

In [11]:
df_pyspark = spark.read.csv('test1.csv', inferSchema=True, header=True)

## Show the dataset

In [13]:
df_pyspark.show()

+------+---+----------+
|  Name|Age|Experience|
+------+---+----------+
|Tushti| 25|         2|
|  Neha| 29|         5|
|Swathi| 24|         1|
+------+---+----------+

In [16]:
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)

## Datatypes of the column

In [18]:
df_pyspark.dtypes

[('Name', 'string'), ('Age', 'int'), ('Experience', 'int')]

## Get Column Name

In [21]:
df_pyspark.columns

['Name', 'Age', 'Experience']

## Top 3 rows

In [22]:
df_pyspark.head(3)

[Row(Name='Tushti', Age=25, Experience=2),
 Row(Name='Neha', Age=29, Experience=5),
 Row(Name='Swathi', Age=24, Experience=1)]

## Print the column name and it's content

In [27]:
df_pyspark.select('Name').show()

+------+
|  Name|
+------+
|Tushti|
|  Neha|
|Swathi|
+------+

## Print Multiple Column Names and their content

In [28]:
df_pyspark.select(['Name','Experience']).show()

+------+----------+
|  Name|Experience|
+------+----------+
|Tushti|         2|
|  Neha|         5|
|Swathi|         1|
+------+----------+

## Basic information of all columns

In [30]:
df_pyspark.describe().show()

+-------+------+------------------+------------------+
|summary|  Name|               Age|        Experience|
+-------+------+------------------+------------------+
|  count|     3|                 3|                 3|
|   mean|  NULL|              26.0|2.6666666666666665|
| stddev|  NULL|2.6457513110645907|2.0816659994661326|
|    min|  Neha|                24|                 1|
|    max|Tushti|                29|                 5|
+-------+------+------------------+------------------+

## Adding Columns

In [33]:
df_pyspark.withColumn('Experience after 2 years', df_pyspark['Experience']+2).show()

+------+---+----------+------------------------+
|  Name|Age|Experience|Experience after 2 years|
+------+---+----------+------------------------+
|Tushti| 25|         2|                       4|
|  Neha| 29|         5|                       7|
|Swathi| 24|         1|                       3|
+------+---+----------+------------------------+

## Changing Column Name

In [35]:
df_pyspark.withColumnRenamed('Name','FullName').show()

+--------+---+----------+
|FullName|Age|Experience|
+--------+---+----------+
|  Tushti| 25|         2|
|    Neha| 29|         5|
|  Swathi| 24|         1|
+--------+---+----------+

## Drop Columns

In [37]:
df = df_pyspark.withColumn('Experience after 2 years', df_pyspark['Experience']+2)

In [38]:
df.show()

+------+---+----------+------------------------+
|  Name|Age|Experience|Experience after 2 years|
+------+---+----------+------------------------+
|Tushti| 25|         2|                       4|
|  Neha| 29|         5|                       7|
|Swathi| 24|         1|                       3|
+------+---+----------+------------------------+

In [41]:
df = df.drop('Experience')

In [42]:
df.show()

+------+---+------------------------+
|  Name|Age|Experience after 2 years|
+------+---+------------------------+
|Tushti| 25|                       4|
|  Neha| 29|                       7|
|Swathi| 24|                       3|
+------+---+------------------------+

## Read a new Dataset

In [48]:
df_spark = spark.read.csv('test2.csv',header=True,inferSchema=True)

In [49]:
df_spark.show()

+----------+----+----------+------+
|      Name| Age|Experience|Salary|
+----------+----+----------+------+
|    Tushti|  25|         3| 90000|
|      Neha|  29|         5|118000|
|    Swathi|  24|         1| 85000|
|     Rohan|  25|         2| 98000|
|  Ashutosh|  27|         3| 92000|
|Hrushikesh|  25|         2| 87000|
|     Myles|NULL|      NULL| 75000|
|      NULL|  34|         8|157000|
|      NULL|  37|      NULL|  NULL|
+----------+----+----------+------+

## Drop Null Values
### When we use na it will drop the rows that have a null value

In [53]:
df_spark.na.drop().show()

+----------+---+----------+------+
|      Name|Age|Experience|Salary|
+----------+---+----------+------+
|    Tushti| 25|         3| 90000|
|      Neha| 29|         5|118000|
|    Swathi| 24|         1| 85000|
|     Rohan| 25|         2| 98000|
|  Ashutosh| 27|         3| 92000|
|Hrushikesh| 25|         2| 87000|
+----------+---+----------+------+

### if you want to drop rows that have all values as null, you use how='all', by default how='any'. Since we don't have any rows with all null values we won't see any change.

In [56]:
df_spark.na.drop(how='all').show()

+----------+----+----------+------+
|      Name| Age|Experience|Salary|
+----------+----+----------+------+
|    Tushti|  25|         3| 90000|
|      Neha|  29|         5|118000|
|    Swathi|  24|         1| 85000|
|     Rohan|  25|         2| 98000|
|  Ashutosh|  27|         3| 92000|
|Hrushikesh|  25|         2| 87000|
|     Myles|NULL|      NULL| 75000|
|      NULL|  34|         8|157000|
|      NULL|  37|      NULL|  NULL|
+----------+----+----------+------+

## Threshold
### Thresh = 2 means atleast there should be 2 non null values in a row otherwise drop

In [57]:
df_spark.na.drop(how='any',thresh=2).show()

+----------+----+----------+------+
|      Name| Age|Experience|Salary|
+----------+----+----------+------+
|    Tushti|  25|         3| 90000|
|      Neha|  29|         5|118000|
|    Swathi|  24|         1| 85000|
|     Rohan|  25|         2| 98000|
|  Ashutosh|  27|         3| 92000|
|Hrushikesh|  25|         2| 87000|
|     Myles|NULL|      NULL| 75000|
|      NULL|  34|         8|157000|
+----------+----+----------+------+

In [59]:
df_spark.na.drop(how='any',thresh=3).show()

+----------+---+----------+------+
|      Name|Age|Experience|Salary|
+----------+---+----------+------+
|    Tushti| 25|         3| 90000|
|      Neha| 29|         5|118000|
|    Swathi| 24|         1| 85000|
|     Rohan| 25|         2| 98000|
|  Ashutosh| 27|         3| 92000|
|Hrushikesh| 25|         2| 87000|
|      NULL| 34|         8|157000|
+----------+---+----------+------+

### The row 'Myles' was dropped because it has only 2 non null values but we want atleast 3

## Subset
### Will drop a row with null values from a particular column

In [62]:
df_spark.na.drop(how='any',subset=['Experience']).show()

+----------+---+----------+------+
|      Name|Age|Experience|Salary|
+----------+---+----------+------+
|    Tushti| 25|         3| 90000|
|      Neha| 29|         5|118000|
|    Swathi| 24|         1| 85000|
|     Rohan| 25|         2| 98000|
|  Ashutosh| 27|         3| 92000|
|Hrushikesh| 25|         2| 87000|
|      NULL| 34|         8|157000|
+----------+---+----------+------+

In [64]:
df_spark.na.drop(how='any',subset=['Name']).show()

+----------+----+----------+------+
|      Name| Age|Experience|Salary|
+----------+----+----------+------+
|    Tushti|  25|         3| 90000|
|      Neha|  29|         5|118000|
|    Swathi|  24|         1| 85000|
|     Rohan|  25|         2| 98000|
|  Ashutosh|  27|         3| 92000|
|Hrushikesh|  25|         2| 87000|
|     Myles|NULL|      NULL| 75000|
+----------+----+----------+------+

## Fill missing values
### Will only fill 'Missing Value' for those column with dtype as string

In [71]:
df_spark.na.fill('Missing Value').show()

+-------------+----+----------+------+
|         Name| Age|Experience|Salary|
+-------------+----+----------+------+
|       Tushti|  25|         3| 90000|
|         Neha|  29|         5|118000|
|       Swathi|  24|         1| 85000|
|        Rohan|  25|         2| 98000|
|     Ashutosh|  27|         3| 92000|
|   Hrushikesh|  25|         2| 87000|
|        Myles|NULL|      NULL| 75000|
|Missing Value|  34|         8|157000|
|Missing Value|  37|      NULL|  NULL|
+-------------+----+----------+------+

In [104]:
df_spark.na.fill(7,'Experience').show()

+----------+----+----------+------+
|      Name| Age|Experience|Salary|
+----------+----+----------+------+
|    Tushti|  25|         3| 90000|
|      Neha|  29|         5|118000|
|    Swathi|  24|         1| 85000|
|     Rohan|  25|         2| 98000|
|  Ashutosh|  27|         3| 92000|
|Hrushikesh|  25|         2| 87000|
|     Myles|NULL|         7| 75000|
|      NULL|  34|         8|157000|
|      NULL|  37|         7|  NULL|
+----------+----+----------+------+

### Replace null value using mean of a column

In [72]:
from pyspark.ml.feature import Imputer

In [74]:
imputer = Imputer(
    inputCols =['Age','Experience','Salary'],
    outputCols = ["{}_imputed".format(c) for c in ['Age','Experience','Salary']]
                ).setStrategy('mean')

In [75]:
imputer.fit(df_spark).transform(df_spark).show()

+----------+----+----------+------+-----------+------------------+--------------+
|      Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+----------+----+----------+------+-----------+------------------+--------------+
|    Tushti|  25|         3| 90000|         25|                 3|         90000|
|      Neha|  29|         5|118000|         29|                 5|        118000|
|    Swathi|  24|         1| 85000|         24|                 1|         85000|
|     Rohan|  25|         2| 98000|         25|                 2|         98000|
|  Ashutosh|  27|         3| 92000|         27|                 3|         92000|
|Hrushikesh|  25|         2| 87000|         25|                 2|         87000|
|     Myles|NULL|      NULL| 75000|         28|                 3|         75000|
|      NULL|  34|         8|157000|         34|                 8|        157000|
|      NULL|  37|      NULL|  NULL|         37|                 3|        100250|
+----------+----+----------+------+-----------+------------------+--------------+

### Replace null values with Median

In [78]:
imputer = Imputer(
    inputCols =['Age','Experience','Salary'],
    outputCols = ["{}_imputed".format(c) for c in ['Age','Experience','Salary']]
                ).setStrategy('median')

In [79]:
imputer.fit(df_spark).transform(df_spark).show()

+----------+----+----------+------+-----------+------------------+--------------+
|      Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+----------+----+----------+------+-----------+------------------+--------------+
|    Tushti|  25|         3| 90000|         25|                 3|         90000|
|      Neha|  29|         5|118000|         29|                 5|        118000|
|    Swathi|  24|         1| 85000|         24|                 1|         85000|
|     Rohan|  25|         2| 98000|         25|                 2|         98000|
|  Ashutosh|  27|         3| 92000|         27|                 3|         92000|
|Hrushikesh|  25|         2| 87000|         25|                 2|         87000|
|     Myles|NULL|      NULL| 75000|         25|                 3|         75000|
|      NULL|  34|         8|157000|         34|                 8|        157000|
|      NULL|  37|      NULL|  NULL|         37|                 3|         90000|
+----------+----+----------+------+-----------+------------------+--------------+

## Filter Operations

In [83]:
df_sparkpy = spark.read.csv('test3.csv',header=True,inferSchema=True)

In [84]:
df_sparkpy.show()

+----------+---+----------+------+
|      Name|Age|Experience|Salary|
+----------+---+----------+------+
|    Tushti| 25|         3| 90000|
|      Neha| 29|         5|118000|
|    Swathi| 24|         1| 85000|
|     Rohan| 25|         2| 98000|
|  Ashutosh| 27|         3| 92000|
|Hrushikesh| 25|         2| 87000|
+----------+---+----------+------+

### Salary of People less than or equal to 95000

In [85]:
df_sparkpy.filter("Salary<=95000").show()

+----------+---+----------+------+
|      Name|Age|Experience|Salary|
+----------+---+----------+------+
|    Tushti| 25|         3| 90000|
|    Swathi| 24|         1| 85000|
|  Ashutosh| 27|         3| 92000|
|Hrushikesh| 25|         2| 87000|
+----------+---+----------+------+

In [87]:
df_sparkpy.filter("Salary<=95000").select(['Name','Age']).show()

+----------+---+
|      Name|Age|
+----------+---+
|    Tushti| 25|
|    Swathi| 24|
|  Ashutosh| 27|
|Hrushikesh| 25|
+----------+---+

### 2 or more conditions

In [90]:
df_sparkpy.filter((df_sparkpy['Salary']<=95000) & (df_sparkpy['Salary']>85000)).show()

+----------+---+----------+------+
|      Name|Age|Experience|Salary|
+----------+---+----------+------+
|    Tushti| 25|         3| 90000|
|  Ashutosh| 27|         3| 92000|
|Hrushikesh| 25|         2| 87000|
+----------+---+----------+------+

In [93]:
df_sparkpy.filter((df_sparkpy['Salary']<=95000) & (df_sparkpy['Salary']>85000)).select(['Name','Age']).show()

+----------+---+
|      Name|Age|
+----------+---+
|    Tushti| 25|
|  Ashutosh| 27|
|Hrushikesh| 25|
+----------+---+

### Not operation (~)

In [97]:
df_sparkpy.filter(~(df_sparkpy['Salary']<=95000)).show()

+-----+---+----------+------+
| Name|Age|Experience|Salary|
+-----+---+----------+------+
| Neha| 29|         5|118000|
|Rohan| 25|         2| 98000|
+-----+---+----------+------+

## Group By and Aggregate Functions

In [100]:
spark_df = spark.read.csv('test4.csv',header=True,inferSchema=True)

In [101]:
spark_df.show()

+----+------------+------+
|Name|  Department|Salary|
+----+------------+------+
|Jane|Software Eng| 87000|
|Jane|Data Science| 92000|
|Liza|Software Eng|110000|
| Ram|Software Eng| 98000|
|Jane|    Big Data| 75000|
|Abey|Data Science| 93000|
|Liza|    Big Data| 83000|
| Ram|    Big Data| 77000|
|Nick|Software Eng|125000|
|Nick|Data Science| 90000|
+----+------------+------+

In [105]:
spark_df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Department: string (nullable = true)
 |-- Salary: integer (nullable = true)

### Find max Salary for all with respect to the Name

In [110]:
spark_df.groupBy('Name').sum().show()

+----+-----------+
|Name|sum(Salary)|
+----+-----------+
|Abey|      93000|
|Liza|     193000|
|Nick|     215000|
| Ram|     175000|
|Jane|     254000|
+----+-----------+

### Max Salary

In [116]:
spark_df.groupBy('Name').max().show()

+----+-----------+
|Name|max(Salary)|
+----+-----------+
|Abey|      93000|
|Liza|     110000|
|Nick|     125000|
| Ram|      98000|
|Jane|      92000|
+----+-----------+

### Min Salary

In [117]:
spark_df.groupBy('Name').min().show()

+----+-----------+
|Name|min(Salary)|
+----+-----------+
|Abey|      93000|
|Liza|      83000|
|Nick|      90000|
| Ram|      77000|
|Jane|      75000|
+----+-----------+

### Group by Salary on which department pays highest salary

In [112]:
spark_df.groupBy('Department').sum().show()

+------------+-----------+
|  Department|sum(Salary)|
+------------+-----------+
|Software Eng|     420000|
|    Big Data|     235000|
|Data Science|     275000|
+------------+-----------+

### Find the mean

In [113]:
spark_df.groupBy('Department').mean().show()

+------------+-----------------+
|  Department|      avg(Salary)|
+------------+-----------------+
|Software Eng|         105000.0|
|    Big Data|78333.33333333333|
|Data Science|91666.66666666667|
+------------+-----------------+

### Find the count

In [114]:
spark_df.groupBy('Department').count().show()

+------------+-----+
|  Department|count|
+------------+-----+
|Software Eng|    4|
|    Big Data|    3|
|Data Science|    3|
+------------+-----+

### Total Salary using Aggregrate function

In [115]:
spark_df.agg({'Salary':'sum'}).show()

+-----------+
|sum(Salary)|
+-----------+
|     930000|
+-----------+